InformationRegisters/ПлановыеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеНачисления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеУдержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеУдержания</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияРаботников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уволен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/КадровыйУчет/Ext/Module.bsl
Функция ОбнулитьПлановыеНачисленияУдержания(ДанныеДокумента, Движения) Экспорт
	Подразделение = ДанныеДокумента.Подразделение;	
	Сотрудник = ДанныеДокумента.Сотрудник;	
	Дата = ДанныеДокумента.Дата;	
	МоментВремени = ДанныеДокумента.МоментВремени;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановыеНачисленияСрезПоследних.ВидРасчета КАК ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеНачисления.СрезПоследних(
	|			&Момент,
	|			Сотрудник = &Сотрудник
	|				И Подразделение = &Подразделение) КАК ПлановыеНачисленияСрезПоследних
	|ГДЕ
	|	ПлановыеНачисленияСрезПоследних.Значение <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлановыеУдержанияСрезПоследних.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеУдержания.СрезПоследних(
	|			&Момент,
	|			Сотрудник = &Сотрудник
	|				И Подразделение = &Подразделение) КАК ПлановыеУдержанияСрезПоследних
	|ГДЕ
	|	ПлановыеУдержанияСрезПоследних.Значение <> 0";
	
	Запрос.УстановитьПараметр("Момент", МоментВремени);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда
			
			Запись = Движения.ПлановыеНачисления.Добавить();
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
			
			Запись = Движения.ПлановыеУдержания.Добавить();
			
		Иначе
			
			Сообщить("Странный ВР");
			Продолжить;
			
		КонецЕсли; 
		
		Запись.Период = Дата;
		Запись.Сотрудник = Сотрудник;
		Запись.Подразделение = Подразделение;
		Запись.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
		Запись.Значение = 0;
		
	КонецЦикла;	
	
КонецФункции // ОбнулитьПлановыеНачисленияУдержания()

Функция ОпределитьПодразделениеСотрудника(Сотрудник,Момент) Экспорт
	Цех = Справочники.Подразделения.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Подразделение
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Момент, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияРаботников.Работает);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цех =ВыборкаДетальныеЗаписи.Подразделение;
	КонецЦикла;
	
	
	Возврат Цех;
КонецФункции
 
Функция Обнулить(СтруктураДанных,Движения)
Сотрудник =СтруктураДанных.Сотрудник;
Подразделение =СтруктураДанных.Подразделение;
МоментВремени =СтруктураДанных.МоментВремени;
Дата =СтруктураДанных.Дата;

Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеНачисленияСрезПоследних.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеНачисления.СрезПоследних(
		|			&Момент,
		|			Сотрудник = &Сотрудник
		|				И Подразделение = &Подразделение) КАК ПлановыеНачисленияСрезПоследних
		|ГДЕ
		|	ПлановыеНачисленияСрезПоследних.Значение <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПлановыеУдержанияСрезПоследних.ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеУдержания.СрезПоследних(
		|			&Момент,
		|			Сотрудник = &Сотрудник
		|				И Подразделение = &Подразделение) КАК ПлановыеУдержанияСрезПоследних
		|ГДЕ
		|	ПлановыеУдержанияСрезПоследних.Значение <> 0";

	Запрос.УстановитьПараметр("Момент", МоментВремени);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.ОсновныеНачисления") Тогда
		
			Запись = Движения.ПлановыеНачисления.Добавить();
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ВидРасчета)=Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
			
			Запись = Движения.ПлановыеУдержания.Добавить();
			
		Иначе
			
			Сообщить("Странный ВР");
			Продолжить;
		
		КонецЕсли; 
		
		Запись.Период = Дата;
		Запись.Сотрудник = Сотрудник;
		Запись.Подразделение = Подразделение;
		Запись.ВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
		Запись.Значение = 0;
		
	КонецЦикла;	

КонецФункции // Обнулить()
